[A_Creature_t5_base H7Creature]
mName="学者"
mLore="学者是杰出的巫师，拥有广博的通用魔法、炼金术、冶金学和矿物学知识。他们对纯粹原始魔法及其各个方面的了解超越了白银城的法师们。成为学者的道路艰难而艰巨。他们之中没有年轻人并非没有原因。"

[A_Creature_t5_upregate H7Creature]
mName="巫师导师"
mLore="在学者成为大法师之前，他会先成为巫师导师。他专攻某一领域，并不断完善自己，不仅是为了成为该领域的大师，也是为了在其中发现或发明新的东西。他的任务还包括教导新的学者。巫师导师也是亚莎忠诚的仆人，可以说他们是她的祭司。"

[Ability.A_dome_Buff H7BaseBuff]
mName="魔法穹顶"
mTooltip="该生物在 %durnow 回合内承受来自所有来源的 %res1 伤害。"

[Ability.A_dome_Buff_lv1 H7BaseBuff]
mName="魔法穹顶"
mTooltip="该生物在 %durnow 回合内承受来自所有来源的 %res1 伤害。"

[Ability.A_dome_Buff_lv2 H7BaseBuff]
mName="魔法穹顶"
mTooltip="该生物在 %durnow 回合内承受来自所有来源的 %res1 伤害。"

[Ability.A_dome_Buff_lv3 H7BaseBuff]
mName="魔法穹顶"
mTooltip="该生物在 %durnow 回合内承受来自所有来源的 %res1 伤害。"

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="雪崩"
mTooltip="每场战斗一次，对极大范围内的所有敌人造成 %d %ICON_Water 点水属性伤害。"

[Ability.A_RangedAttack_Ice_Projectile H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远程攻击"
mTooltip="远程攻击"

[Ability.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法穹顶"
mTooltip="所有相邻的友方生物将获得针对所有伤害来源的保护，保护效果取决于它们的冷血等级：\n无冷血：%buff1.buff.res1 \n 等级 1：%buff8.buff.res1 \n 等级 2：%buff3.buff.res1 \n 等级 3：%buff4.buff.res1。\n光环持续到当前回合结束。"